#################        三元运算      #####################
#传统写法：
if a>b:
    value="变量1"
else:
    value="变量2"

#简写形式1
value="变量1" if a>b else "变量2"

#简写形式2
value=("变量1","变量2")[a>b]

#简写形式3
value={"变量1","变量2"}[a>b]

############################################################


#######################   for循环   #########################
### 单循环传统写法
arr=[]
for i in [1,2,3]:
    arr.append(i)
### 简写
arr=[i for i in [1,2,3]]
#############################
###  双循环传统写法
arr=[]
for ii in [[1,2],[3,4]]:
    for i in ii:
        arr.append(i)
### 简写
arr=[i for ii in [[1,2],[3,4]] for i in ii]
############################
### for + if 传统写法
for i in [1,2,3,4,5]:
    if i>3:
        print(i)
### 简写
[print(i) for i in [1,2,3,4,5] if i>3]
#最外面可换成{}
###################################################


############